[M_ClapTrapBeard MissionDefinition]
MissionName="All adults are witches"
MissionDescription="To increase his power, Compulsion needs a bearded beauty. But he cannot grow like a robot..<br><br>He will ask you to kill some dwarves. [place]my heart[-place] Take them in the car. If you collect the beard left in the slaughterhouse, you can grow a new beard.."
TurnInDescription="If he has a beard and a wand, he is a witch. Goat skirt, great. I won't even wear your clothes and beard to public school..."
MissionSummary="Gather facial and shoulder hair and turn the claptrap into a professional beard."
MissionGiver="Church"
MissionTurnInLocation="Claptrap"
TeaserText="What is hairless magic??"

[M_ClapTrapBeard:CollectBeards MissionObjectiveDefinition]
ProgressMessage="beard"

[M_ClapTrapBeard:CollectMagicBeard MissionObjectiveDefinition]
ProgressMessage="Get a magical beard!"

[M_ClapTrapBeard:GetDwarvesDrunk MissionObjectiveDefinition]
ProgressMessage="drinking"

[M_ClapTrapBeard:GiveBeardClaptrap MissionObjectiveDefinition]
ProgressMessage="Pat yourself on the chin"

[M_ClapTrapBeard:LeadDwarvesMachinery MissionObjectiveDefinition]
ProgressMessage="Drink a bottle of wine"

[M_ClapTrapBeard:MissionObjectiveSetDefinition_4 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_ClapTrapBeard:MissionObjectiveSetDefinition_6 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_ClapTrapBeard:ObjSet_CollectBeards MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_ClapTrapBeard:Objset_CollectMagicBeard MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_ClapTrapBeard:ObjSet_PutPiecesForge MissionObjectiveSetDefinition]
MissionSummaryOverride="Get the beard of the new wizard Claptrap.."
MissionDescriptionOverride="The tribune needs a magical beard to increase his power. But as long as you are a robot, you cannot grow..<br><br><br>After the gnomes collect their beards, the stand finds 9000 bearded gnomes and asks them to grow new beards.."

[M_ClapTrapBeard:PutPiecesForge MissionObjectiveDefinition]
ProgressMessage="Place the chip on the grill"

[M_ClapTrapBeard:StrikeForge MissionObjectiveDefinition]
ProgressMessage="Printing money"

